2d_cylinder_vortex_shedding/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom    patch;

sourceCase       "$FOAM_CASE";   // uses current case; can be a separate case
sourcePatches    (Z_max);

// constructFrom patch: name of exposed "original" patch
exposedPatchName Z_min;

flipNormals      true;

extrudeModel     plane;
thickness        1.0;

nLayers          1;
expansionRatio   1.0;

// Merge front and back patches, typically for 360 deg wedge extrusion
mergeFaces       false;
mergeTol         0;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
