2d_cylinder_vortex_shedding/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/include/initialConditions"

ddtSchemes
{
    #if $transient
        default         backward;
    #else
        default         steadyState;
    #endif
}

d2dt2Schemes
{
    #if $transient
        default         Euler;
    #else
        default         steadyState;
    #endif
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    #if $transient
        div(phi,U)      Gauss linearUpwind grad(U);
    #else
        div(phi,U)      bounded Gauss linearUpwind grad(U);
    #endif
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
