2d_cylinder_vortex_shedding/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/include/initialConditions"

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
        maxIter         1000;
    }
    pFinal
    {
        $p;
        relTol         0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
        maxIter         1000;
    }
    UFinal
    {
        $U;
        relTol          0;
    }
}

#if $transient
    PIMPLE
    {
        nCorrectors                 2;
        nOuterCorrectors            1;
        nNonOrthogonalCorrectors    1;

        pRefCell                    0;
        pRefValue                   0;
    }
#else
    SIMPLE
    {
        nNonOrthogonalCorrectors    1;

        pRefCell                    0;
        pRefValue                   0;
    }
#endif

#if $transient
    relaxationFactors
    {
        equations
        {
            ".*"        1.0;
        }
    }
#else
    relaxationFactors
    {
        fields
        {
            p               0.3;
        }
        equations
        {
            U               0.7;
        }
    }
#endif

// ************************************************************************* //
