2d_cylinder_vortex_shedding/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/include/initialConditions"

Ux #calc "cos(degToRad(10)) * $U_inf";
Uy #calc "sin(degToRad(10)) * $U_inf";

defaultFieldValues
(
    volVectorFieldValue U ($U_inf 0 0)
);

regions
(
    boxToCell
    {
        box (-20 -1.0 0) (0 1.0 1);
        fieldValues
        (
            volVectorFieldValue U ($Ux $Uy 0)
        );
    }
);

// ************************************************************************* //
